#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.vpc.google_compute_subnetwork.public-subnetwork: Refreshing state... [id=projects/custom-valve-332208/regions/us-central1/subnetworks/terraform-subnetworks]
module.vpc.google_compute_network.vpc_network: Refreshing state... [id=projects/custom-valve-332208/global/networks/terraform-networks21]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.vpc.google_compute_network.vpc_network will be destroyed
  # (because google_compute_network.vpc_network is not in configuration)
  - resource "google_compute_network" "vpc_network" {
      - auto_create_subnetworks         = true -> null
      - delete_default_routes_on_create = false -> null
      - id                              = "projects/custom-valve-332208/global/networks/terraform-networks21" -> null
      - mtu                             = 0 -> null
      - name                            = "terraform-networks21" -> null
      - project                         = "custom-valve-332208" -> null
      - routing_mode                    = "REGIONAL" -> null
      - self_link                       = "https://www.googleapis.com/compute/v1/projects/custom-valve-332208/global/networks/terraform-networks21" -> null
    }

  # module.vpc.google_compute_subnetwork.public-subnetwork will be destroyed
  # (because google_compute_subnetwork.public-subnetwork is not in configuration)
  - resource "google_compute_subnetwork" "public-subnetwork" {
      - creation_timestamp         = "2022-01-24T02:23:42.915-08:00" -> null
      - gateway_address            = "10.2.0.1" -> null
      - id                         = "projects/custom-valve-332208/regions/us-central1/subnetworks/terraform-subnetworks" -> null
      - ip_cidr_range              = "10.2.0.0/16" -> null
      - name                       = "terraform-subnetworks" -> null
      - network                    = "https://www.googleapis.com/compute/v1/projects/custom-valve-332208/global/networks/terraform-networks21" -> null
      - private_ip_google_access   = false -> null
      - private_ipv6_google_access = "DISABLE_GOOGLE_ACCESS" -> null
      - project                    = "custom-valve-332208" -> null
      - region                     = "us-central1" -> null
      - secondary_ip_range         = [] -> null
      - self_link                  = "https://www.googleapis.com/compute/v1/projects/custom-valve-332208/regions/us-central1/subnetworks/terraform-subnetworks" -> null
    }

  # module.vpc2.google_compute_network.vpc_network will be created
  + resource "google_compute_network" "vpc_network" {
      + auto_create_subnetworks         = true
      + delete_default_routes_on_create = false
      + gateway_ipv4                    = (known after apply)
      + id                              = (known after apply)
      + mtu                             = (known after apply)
      + name                            = "terraform-networkss"
      + project                         = (known after apply)
      + routing_mode                    = (known after apply)
      + self_link                       = (known after apply)
    }

  # module.vpc2.google_compute_subnetwork.public-subnetwork will be created
  + resource "google_compute_subnetwork" "public-subnetwork" {
      + creation_timestamp         = (known after apply)
      + fingerprint                = (known after apply)
      + gateway_address            = (known after apply)
      + id                         = (known after apply)
      + ip_cidr_range              = "10.2.0.0/16"
      + name                       = "terraform-subnetworks"
      + network                    = "terraform-networkss"
      + private_ipv6_google_access = (known after apply)
      + project                    = (known after apply)
      + region                     = "us-central1"
      + secondary_ip_range         = (known after apply)
      + self_link                  = (known after apply)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @rrajpald, Action: `pull_request`*